Revit 2026 API

# FailureDefinitionAccessorGetDescriptionText Method

---

Retrieves the description text of the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetDescriptionText()
```
```vb
Public Function GetDescriptionText As String
```
```cpp
public:
String^ GetDescriptionText()
```
```fsharp
member GetDescriptionText : unit -> string
```

#### Return Value

String The description text.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The FailureDefinitionAccessor has not been properly initialized. |

Retrieved description text for built-in Revit failures is localized. The result may vary from the description text retrieved from the corresponding FailureMessage. A failure definition contains a description string, that may have format specifiers like %s, and "sample" strings, that will be used to resolve them. A FailureMessage will contain "specific" strings. So, in the failure definition description "Cannot keep %s joined" will be converted into "Cannot keep Element joined" while the description in actual FailureMessage will read "Cannot keep Walls joined" or "Cannot keep Beams joined"

#### Reference

FailureDefinitionAccessor Class

Autodesk.Revit.DB Namespace